<a href="https://colab.research.google.com/github/aydanaghabayli/BIM2GNN/blob/main/BIM2GNN_Rooms_V2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import os
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import re

In [ ]:
%matplotlib inline

In [ ]:
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

In [ ]:
os.chdir("/content/gdrive/My Drive/WorkingFiles")

In [ ]:
#importing raw .csv data

room_data_0 = pd.read_csv("RoomSchedule4_V2.csv", header=1)
room_data_1 = pd.read_csv("RoomSchedule3_V2.csv", header=1)
room_data_2 = pd.read_csv("RoomSchedule5_V2.csv", header=1)

In [ ]:
room_data_0

       Area  Number           Name
0       NaN     NaN            NaN
1     10 m²  1027.0  Group 255 KIT
2     13 m²  1028.0  Group 255 NB1
3      7 m²  1029.0  Group 255 LVR
4      6 m²  1030.0   Group 255 WC
...     ...     ...            ...
1020   8 m²  2046.0    Group 1 LVR
1021  12 m²  2047.0    Group 0 NB1
1022   9 m²  2048.0    Group 0 KIT
1023   7 m²  2049.0    Group 0 LVR
1024   7 m²  2050.0     Group 0 WC

[1025 rows x 3 columns]

In [ ]:
room_data_1

      Area  Number           Name
0      NaN     NaN            NaN
1    36 m²  1025.0  Group 255 KIT
2    49 m²  1026.0  Group 255 LVR
3    28 m²  1027.0   Group 255 WC
4    31 m²  1028.0  Group 254 KIT
..     ...     ...            ...
140  28 m²  1749.0   Group 14 KIT
141  15 m²  1750.0    Group 14 WC
142  35 m²  1751.0   Group 13 KIT
143  23 m²  1752.0   Group 13 LVR
144  54 m²  1753.0    Group 13 WC

[145 rows x 3 columns]

In [ ]:
#deleting NaN values

room_data_0 = room_data_0.dropna()
room_data_1 = room_data_1.dropna()
room_data_2 = room_data_2.dropna()

In [ ]:
#making the numbers of the layouts sequential and delete simplify layout names

room_data_1 = room_data_1.assign (Name = room_data_1.Name.apply(lambda x: re.sub(r'Group \d+', str(int(x.split()[1])+256), x)))
room_data_2 = room_data_2.assign (Name = room_data_2.Name.apply(lambda x: re.sub(r'Group \d+', str(int(x.split()[1])+512), x)))
#simplify layout names

room_data_0['Name'] = room_data_0['Name'].str.replace(r'Group ', '')

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

In [ ]:
#filtering not useful columns

room_data_0 = room_data_0.drop("Number", axis=1)
room_data_1 = room_data_1.drop("Number", axis=1)
room_data_2 = room_data_2.drop("Number", axis=1)

In [ ]:
room_data_1

      Area     Name
1    36 m²  511 KIT
2    49 m²  511 LVR
3    28 m²   511 WC
4    31 m²  510 KIT
5    21 m²  510 LVR
..     ...      ...
140  28 m²  270 KIT
141  15 m²   270 WC
142  35 m²  269 KIT
143  23 m²  269 LVR
144  54 m²   269 WC

[144 rows x 2 columns]

In [ ]:
#creating a list of three datasets

room_data_list = [room_data_2, room_data_1, room_data_0 ]

In [ ]:
#merging list into one dataset

room_dataT = pd.concat(room_data_list)

In [ ]:
room_dataT

       Area     Name
1     32 m²  767 KIT
2     36 m²  767 NB1
3     21 m²   767 WC
4     21 m²  767 LVR
5     32 m²  766 NB2
...     ...      ...
1020   8 m²    1 LVR
1021  12 m²    0 NB1
1022   9 m²    0 KIT
1023   7 m²    0 LVR
1024   7 m²     0 WC

[2442 rows x 2 columns]

In [ ]:
#simplifing data instances

room_dataT['Area'] = room_dataT['Area'].str.replace(r' m²', '')

In [ ]:
#changing the order of columns

room_dataT = room_dataT [['Name','Area']]

In [ ]:
room_dataT

         Name Area
1     767 KIT   32
2     767 NB1   36
3      767 WC   21
4     767 LVR   21
5     766 NB2   32
...       ...  ...
1020    1 LVR    8
1021    0 NB1   12
1022    0 KIT    9
1023    0 LVR    7
1024     0 WC    7

[2442 rows x 2 columns]

In [ ]:
#saving as .csv file

room_dataT.to_csv("/content/gdrive/My Drive/WorkingFiles/RoomData_Filtered.csv")